{
  "base_answers": {
    "admission_fees": "Admission fees vary by program. For example: B.Tech ~ INR 1.2–1.6L/yr, MBA ~ INR 1.4–2.0L/yr, MBBS ~ INR 15-20L/yr (approx). Always verify the latest schedule on the official site or with Admissions.",
    "hostel_fees": "Separate boys and girls hostels are available. Typical annual charges ~ INR 70k–1.2L based on room type and mess plan. Contact the Hostel Office for current rates and availability.",
    "placement": "Integral University has an active Training & Placement Cell. Average packages vary by program/year; CSE often trends higher among UG programs. Refer to the T&P Cell for yearly stats.",
    "admission_process": "Apply via the online admissions portal: register, complete the application, upload documents, pay the fee, and follow merit/counseling updates. Eligibility and required tests vary by program.",
    "university_overview": "Integral University is a premier private university located in Lucknow, Uttar Pradesh, India. Established in 2004, it is recognized by UGC, AICTE, BCI, PCI, and COA. The university offers a wide range of undergraduate, postgraduate, and doctoral programs across multiple disciplines including Engineering, Management, Pharmacy, Medicine, Dentistry, Law, Computer Applications, Sciences, Humanities, and more. With a sprawling campus spanning over 100 acres, it provides a conducive environment for holistic development.",
    "facilities": "Integral University boasts state-of-the-art facilities including a modern library with extensive digital resources, well-equipped laboratories for engineering and science programs, separate hostels for boys and girls with mess facilities, sports complexes, auditoriums, medical center, transportation services, and Wi-Fi enabled campus. The university also has collaborations with industry partners for research and internships.",
    "rankings": "Integral University has been consistently ranked among the top private universities in India. It has received accolades from various bodies and is known for its quality education, research output, and placement records. Specific rankings include positions in NIRF rankings for various categories.",
    "contact_info": "Address: Integral University, Dasauli, Kursi Road, Lucknow - 226026, Uttar Pradesh, India. Phone: +91-522-2890730, 2890812. Email: info@integraluniversity.ac.in. Website: www.integraluniversity.ac.in.",
    "programs_offered": "Integral University offers programs in: Engineering (B.Tech, M.Tech in CSE, ECE, Civil, Mechanical, Biotechnology, etc.), Diploma (Engineering, Pharmacy, etc.), Management (MBA, BBA), Pharmacy (B.Pharm, M.Pharm, D.Pharm), Medicine (MBBS, MD, MS), Dentistry (BDS), Law (LLB, LLM, BA LLB), Computer Applications (BCA, MCA), Sciences (BSc, MSc in various specializations), Humanities (BA, MA), Education, and Doctoral programs (PhD) across multiple disciplines.",
    "campus_life": "The university offers a vibrant campus life with numerous student clubs, cultural events, technical fests, sports tournaments, and extracurricular activities. Students can participate in NSS, NCC, and various societies. The campus is safe, green, and provides opportunities for overall personality development.",
    "chatbot_intro": "Hello! I am the Integral University Chatbot. I'm here to help you with information about Integral University, including fees, hostel details, placements, admission processes, exam details, scholarships, societies, project work, and more. I can answer questions in both English and Hindi. Feel free to ask me anything about the university, and I'll provide accurate information based on the latest available data.",
    "scholarships": "Integral University provides various scholarships to support deserving students. These include merit-based scholarships for top performers in entrance exams or academics, need-based financial aid for economically weaker sections, sports scholarships for outstanding athletes, and special category scholarships for SC/ST/OBC students. Eligibility criteria, application processes, and amounts vary. Visit the university's scholarship portal or contact the Admissions Office for detailed information and deadlines.",
    "societies": "Integral University offers a wide range of student societies and clubs to enhance extracurricular development. Key societies include: Technical Societies (IEEE Student Branch, CSI, ACM), Cultural Societies (Drama, Music, Dance, Fine Arts), Sports Clubs (Cricket, Football, Basketball, Athletics), Literary Societies (Debate, Quiz, Literary Club), NSS (National Service Scheme) for community service, NCC (National Cadet Corps) for defense training, Entrepreneurship Cell for budding entrepreneurs, and Environment Club for sustainability initiatives. Students can join societies based on their interests and participate in events, workshops, and competitions.",
    "project_work": "Integral University emphasizes practical learning through various project works. This includes: Academic Projects (semester-wise assignments and group projects), Internships (mandatory industry placements with partner companies), Research Projects (under faculty mentorship in labs for UG/PG/PhD students), Capstone Projects (final-year major projects in engineering, management, and science programs), and Collaborative Projects (with industry for real-world problem-solving). Students receive guidance, resources, and opportunities to present at conferences. The university's industry collaborations ensure relevant and innovative project experiences."
  },
  "program_fee_hints": {
    "btech": "B.Tech fees are typically around INR 1.2–1.6L per year (approx).",
    "mtech": "M.Tech fees are typically around INR 1.0–1.5L per year (approx).",
    "cse": "CSE (B.Tech) fees fall under the B.Tech range (approx INR 1.2–1.6L per year).",
    "ece": "ECE (B.Tech) fees fall under the B.Tech range (approx INR 1.2–1.6L per year).",
    "mba": "MBA fees are typically around INR 1.4–2.0L per year (approx).",
    "bba": "BBA fees are typically around INR 0.8–1.2L per year (approx).",
    "bpharm": "B.Pharm fees are typically around INR 1.0–1.4L per year (approx).",
    "civil": "Civil (B.Tech) fees fall under the B.Tech range (approx INR 1.2–1.6L per year).",
    "mechanical": "Mechanical (B.Tech) fees fall under the B.Tech range (approx INR 1.2–1.6L per year).",
    "biotech": "Biotechnology (B.Tech/BSc) fees vary by program; typically ~ INR 1.0–1.6L per year (approx).",
    "mbbs": "MBBS fees are approximately INR 15-20L per year (approx).",
    "bds": "BDS fees are approximately INR 10-15L per year (approx).",
    "diploma": "Diploma fees are typically around INR 0.5-1.0L per year (approx).",
    "bsc": "BSc fees vary by specialization; typically INR 0.5-1.0L per year (approx).",
    "bca": "BCA fees are typically around INR 0.8-1.2L per year (approx)."
  },
  "program_placement_hints": {
    "cse": "CSE often sees higher average packages among UG programs.",
    "ece": "ECE placements vary by year and recruiting companies.",
    "btech": "Engineering programs have varied placements depending on discipline.",
    "mtech": "M.Tech placements depend on specialization and research/industry roles.",
    "mba": "MBA placements vary by specialization; check current recruiters and roles.",
    "bba": "BBA placements depend on domain and internships.",
    "bpharm": "Pharmacy placements often include pharma and healthcare roles.",
    "civil": "Civil placements depend on infra/construction cycles and recruiters.",
    "mechanical": "Mechanical placements vary across manufacturing, automotive, and core roles.",
    "biotech": "Biotech placements include pharma, research, and healthcare domains.",
    "mbbs": "MBBS graduates can pursue careers in hospitals, clinics, research, or further specialization in MD/MS.",
    "bds": "BDS graduates can work in dental clinics, hospitals, or pursue MDS for specialization.",
    "diploma": "Diploma graduates can pursue careers in technical fields or use lateral entry to degree programs.",
    "bsc": "BSc placements depend on specialization; options in research, teaching, or industry roles.",
    "bca": "BCA graduates often find roles in IT, software development, data entry, and related fields."
  },
  "program_exam_hints": {
    "btech": "Admission via JEE Main or IUET. Eligibility: 10+2 with PCM, min 45% marks.",
    "mtech": "Admission via GATE or IUET, or merit. Eligibility: B.Tech/BE in relevant field, min 50% marks.",
    "cse": "Admission via JEE Main or IUET. Eligibility: 10+2 with PCM, min 45% marks.",
    "ece": "Admission via JEE Main or IUET. Eligibility: 10+2 with PCM, min 45% marks.",
    "mba": "Admission via CAT/MAT/CMAT or IUET. Eligibility: Bachelor's degree, min 50% marks.",
    "bba": "Admission via IUET or merit. Eligibility: 10+2, min 45% marks.",
    "bpharm": "Admission via IUET or merit. Eligibility: 10+2 with PCM/Biology, min 45% marks.",
    "civil": "Admission via JEE Main or IUET. Eligibility: 10+2 with PCM, min 45% marks.",
    "mechanical": "Admission via JEE Main or IUET. Eligibility: 10+2 with PCM, min 45% marks.",
    "biotech": "Admission via JEE Main or IUET. Eligibility: 10+2 with PCM/Biology, min 45% marks.",
    "mbbs": "Admission via NEET. Eligibility: 10+2 with PCB, min 50% marks.",
    "bds": "Admission via NEET. Eligibility: 10+2 with PCB, min 50% marks.",
    "diploma": "Admission via IUET or merit. Eligibility: 10th pass, min 35% marks.",
    "bsc": "Admission via IUET or merit. Eligibility: 10+2 with relevant subjects, min 45% marks.",
    "bca": "Admission via IUET or merit. Eligibility: 10+2 with Mathematics, min 45% marks."
  }
}